app/controllers/agencies_controller.rb

SELECT * FROM `agencies` WHERE (`agencies`.`id` = 1)
---
  def settings

    @agency = Agency.find(session[:agencyId])

SELECT * FROM `agencies` WHERE (`agencies`.`id` = 1)
SELECT "timesheets".* FROM "timesheets" , contracts, clients, agencies, contractors, users WHERE ((contracts.id = timesheets.contract_id and timesheets.contractor_id = contractors.id and contractors.user_id = users.id and clients.id = contracts.client_id and clients.agency_id = 1) AND (timesheets.status IN ('DENIED', 'DRAFT', 'SUBMITTED', 'MANUAL', 'REJECTED'))) ORDER BY timesheets.startDate ASC LIMIT 26 OFFSET 0
---
  def outstanding

    session[:selected] = 'dashboard'

    # get the agency
    @agency = Agency.find(session[:agencyId])

    # set the status to search
    @status = params[:status]

    # set the sort order
    @selected_column = params[:c].blank? ? 'startDate' : params[:c]

    # go go go
    @timesheets = Timesheet.find_all_by_agency(params[:page], 26, @agency, @status ||= 'ANY', sort_order('startDate'))

INSERT INTO "agencies" ("name", "addr1", "city", "region", "addr2", "created_at", "addr3", "trial", "updated_at", "postCode", "nextInvoiceNumber", "useInvoicing", "autoReminder", "cutOffTime", "phone", "fax", "calculatePAYE", "defaultMargin", "cutOffDay", "sageNominalCode", "email", "active", "invoicing") VALUES('teste', 'teste', 'teste', '', '', '2009-11-27 20:49:06', '', 't', '2009-11-27 20:49:06', '1212121212', 1, 't', 'f', NULL, '121212121', '12121212', 't', 0.0, NULL, NULL, 'teste@teste.com', NULL, 'f')
---
  def create

    # get the agency
    @agency = Agency.new(params[:agency])

    # get the user
    @user = User.new(params[:user])

    # get t & c status
    @t_and_c = params[:t_and_c]

    if @t_and_c != 'on'

      # havent viewed the Ts & Cs
      flash[:error] = "You must read the terms and conditions before registering"
      render :action => "new", :layout => 'clockoff'

    else

      # everything is good... save!
      Agency.transaction do

        # save the agency
        if @agency.save

INSERT INTO "users" ("salt", "addr1", "city", "region", "lastName", "activated_at", "addr2", "created_at", "crypted_password", "remember_token_expires_at", "addr3", "title", "password_reset_code", "deleted_at", "updated_at", "activation_code", "postCode", "userType", "contractor_id", "mobile", "remember_token", "firstName", "phone", "login", "email", "state", "agency_id") VALUES('4fcbdc1d0024e8c2ec2ee4e807ae5da3b252b056', NULL, NULL, NULL, 'Brand', '2009-12-01 00:06:05', NULL, '2009-12-01 00:06:05', 'cbf33e46e9696333282abb462b6bc47a19baf18f', NULL, NULL, 'Mr', 'abe0940d460f4f335f8a919aa2e2cdeb9b7cf684', NULL, '2009-12-01 00:06:05', 'a0f7a7ee37a16a2f9d6dddc82607b7d08b443fe8', NULL, 'agency', NULL, NULL, NULL, 'James', '020 7827 9323', 'jamesbrand', 'james.brand@intura.co.uk', 'active', 1)
UPDATE "users" SET "updated_at" = '2009-12-01 00:06:08', "activated_at" = '2009-12-01 00:06:08', "activation_code" = NULL, "state" = 'active' WHERE "id" = 6
---
          @user.only_basic_validation = true

          # save the user
          if @user.save

SELECT * FROM `agencies` WHERE (`agencies`.`id` = 1)
UPDATE `agencies` SET `updated_at` = '2009-12-03 17:17:28', `addr2` = '', `region` = '', `addr3` = '' WHERE `id` = 1
---
  def update

    # get the agency
    @agency = Agency.find(session[:agencyId])

    # set the attributes
    @agency.attributes = params[:agency]

    # save the agency
    begin
      if @agency.save

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
SELECT * FROM "contractors" WHERE ("contractors"."id" = 3)
---
  def set_report_header(from_date, to_date, client_id, contractor_id)

    header = ''

    # if we have a client id, its for a specific client
    if !client_id.blank?

      client = Client.find(client_id.to_i)
      header = "For #{client.name}"

    else

      header = "For all clients"

    end

    # do we have a contractor id?
    if contractor_id.to_i > 0

      contractor = Contractor.find(contractor_id.to_i)