app/controllers/invoices_controller.rb

SELECT * FROM "agencies" WHERE ("agencies"."id" = 1)
---
  def index

    session[:selected] = 'invoicing'

    # define formats
    @formats = ['CSV', 'CSV for Sage']

    # get agency
    @agency = Agency.find(session[:agencyId])