app/controllers/users_controller.rb

  def check_login

    login = params[:login]
    @result = true
    @result = User.exists?(:login => login) unless login.blank?
---
SELECT "users".id FROM "users" WHERE ("users"."login" = 'marcelo') LIMIT 1